# pandas nos permite ver tablas ordenadas con datos
# segun necesitemos, tambien nos permite ordenar
# antes de visualizar nuestra tabla, seleccionar columnas
# filas o seleccionar datos especificos

In [5]:
#importamos pandas
import pandas as pd

In [6]:
#crearemos nuestra tabla y la guardaremos con pandas
fb = ['Facebook', 988833, True, 2006]
twt = ['Twitter', 857575, False, 2008]
ig = ['Instagram', 757575, True, 2010]
wsp = ['Whatsapp', 22828828, True, 2009]
tel = ['Telegram', 292992, False, 2010]
lkn = ['Linkdin', 47477277, False, 2012]

lista_rrss=[fb,twt,ig,wsp,tel,lkn]

In [11]:
#creamos nuestro dataframe con la tabla y los datos
#lo guardamos dentro de df_rrss, llamamos al paquete pd.DataFrame para guardar
#nuestro argumento() sera la lista y le asignamos las cabeceras de las columnas
df_rrss=pd.DataFrame(lista_rrss,
            columns = ['Nombre', 'Cantidad', 'Pertecene_a_FB', 'Año'])
df_rrss

      Nombre  Cantidad  Pertecene_a_FB   Año
0   Facebook    988833            True  2006
1    Twitter    857575           False  2008
2  Instagram    757575            True  2010
3   Whatsapp  22828828            True  2009
4   Telegram    292992           False  2010
5    Linkdin  47477277           False  2012

In [12]:
#crearemos tambien un dataframe vacio y le asiganamos columnas
df_vacio=pd.DataFrame(columns = ['nombre', 'apellido', 'edad'])
df_vacio

Empty DataFrame
Columns: [nombre, apellido, edad]
Index: []

In [15]:
#ahora llenaremos esa tabla con datos
df_vacio=df_vacio.append({'nombre':'Alonso',
                          'apellido':'Carrasco',
                          'edad':7},
                         ignore_index=True)
df_vacio

   nombre  apellido edad
0  Alonso  Carrasco    7

**lo normal es exportar archivos en excel para llenar nuestras tablas
en conjunto crear los dataframes con ellos**

# AHORA VEREMOS SELECCION POR FILAS Y COLUMNAS

In [16]:
df_rrss

      Nombre  Cantidad  Pertecene_a_FB   Año
0   Facebook    988833            True  2006
1    Twitter    857575           False  2008
2  Instagram    757575            True  2010
3   Whatsapp  22828828            True  2009
4   Telegram    292992           False  2010
5    Linkdin  47477277           False  2012

In [18]:
#aqui buscamos en la columna nombre y la posicion 1 (locate)
df_rrss.loc[1,'Nombre']

'Twitter'

In [19]:
#aqui buscamos en la columna nuevamente y posicion 1, la dif de iloc es q no lleva nombre
df_rrss.iloc[1,0]

'Twitter'

In [21]:
#obtenemos toda la columna nombre
df_rrss['Nombre']

0     Facebook
1      Twitter
2    Instagram
3     Whatsapp
4     Telegram
5      Linkdin
Name: Nombre, dtype: object

In [22]:
#obtenemos una fila con iloc
#consultamos la linea 4 con su info
df_rrss.iloc[4]

Nombre            Telegram
Cantidad            292992
Pertecene_a_FB       False
Año                   2010
Name: 4, dtype: object

In [25]:
#consultamos al boolean
#donde deben ser mayor a 300mil
df_rrss['Cantidad']>300000

0     True
1     True
2     True
3     True
4    False
5     True
Name: Cantidad, dtype: bool

In [28]:
#ahora consultamos especificamente las rrss q tengan -300mil usuarios
df_rrss[df_rrss['Cantidad']<300000]

     Nombre  Cantidad  Pertecene_a_FB   Año
4  Telegram    292992           False  2010

# ordenar por columnas de mayor a menor o >.<

In [30]:
#ordenar de modo ascendente de A-Z los nombres y preguntamos
df_rrss.sort_values('Nombre', ascending=True)

      Nombre  Cantidad  Pertecene_a_FB   Año
0   Facebook    988833            True  2006
2  Instagram    757575            True  2010
5    Linkdin  47477277           False  2012
4   Telegram    292992           False  2010
1    Twitter    857575           False  2008
3   Whatsapp  22828828            True  2009

In [33]:
#ordenamos de modo descendente de menor a mayor el año
#si usamos el true nos ordena al reves
df_rrss.sort_values('Año', ascending=False)

      Nombre  Cantidad  Pertecene_a_FB   Año
5    Linkdin  47477277           False  2012
2  Instagram    757575            True  2010
4   Telegram    292992           False  2010
3   Whatsapp  22828828            True  2009
1    Twitter    857575           False  2008
0   Facebook    988833            True  2006

In [39]:
#ordenar el df x 2 valores ascendente
df_rrss.sort_values(['Nombre', 'Año'], ascending=[True, True])

      Nombre  Cantidad  Pertecene_a_FB   Año
0   Facebook    988833            True  2006
2  Instagram    757575            True  2010
5    Linkdin  47477277           False  2012
4   Telegram    292992           False  2010
1    Twitter    857575           False  2008
3   Whatsapp  22828828            True  2009

In [1]:
#como cargar un documento en excel
import pandas as pd

df = pd.read_csv('data.csv')

print(df.to_string())
#cuando usa el .to_string es para mostrar toda la informacion.

#cargar jsons
import pandas as pd

df = pd.read_json('data.json')

print(df.to_string())